Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/travel_and_recreation/motoring_1/motor_tax_and_insurance/motor_tax_rates.html.txt.tmx
Source language: en
Languages: ga

source: There are additional requirements for goods and other vehicles when renewing your motor tax:
ga: Tá riachtanais bhreise ann i dtaca le feithiclí earraí agus eile nuair a dhéanann tú do mhótarcháin a athnuachan

source: • A certificate of roadworthiness (CRW) issued by an authorised tester for all goods vehicles, buses, coaches and ambulances that are 1 year old or over
ga: • Deimhniú ródacmhainneachta (DRA) a eisíonn tástálaí údaraithe do gach feithicil earraí, bus, cóiste agus otharcharr atá 1 bhliain d’aois nó níos sine

source: • A PSV licence for small and large public service vehicles
ga: • Ceadúnas FSP i gcás feithiclí beaga agus móra seirbhíse poiblí

source: Taxing your vehicle online
ga: Cáin a íoc ar d’fheithicil ar líne

source: At motortax.ie you can tax a new vehicle or renew your motor tax online
ga: Is féidir leat cáin a íoc ar fheithicil nua nó do mhótarcháin a athnuachan ar líne ag motortax.ie

source: When taxing a new vehicle you need Form RF100 (available from you motor dealer)
ga: Nuair a íocann tú cáin ar fheithicil nua, teastaíonn Foirm RF100 uait (atá ar fáil ó do dhéileálaí gluaisteán)

source: When renewing your motor tax you need Form RF100B (computerised reminder form)
ga: Nuair a bhíonn do mhótarcháin á hathnuachan agat, teastaíonn Foirm RF100B (foirm mheabhrúcháin ríomhairithe) uait

source: You can renew the motor tax on a second-hand vehicle you have recently purchased, but you must be the registered owner of the vehicle (see document on change of vehicle ownership)
ga: Féadfaidh tú an mhótarcháin ar fheithicil athláimhe a cheannaigh tú le déanaí a athnuachan, ach ní mór gur tú féin úinéir cláraithe na feithicle (féach an cháipéis ar athrú úinéireacht feithicle)

source: You need your insurance details and a debit or credit card for paying the tax
ga: Teastaíonn do chuid sonraí árachais agus cárta dochair nó creidmheasa chun an cháin a íoc

source: Only the following types of vehicles can be taxed online; private cars, motorcycles, agricultural tractors, excavators/diggers, combine harvesters, hearses, vehicles adapted for use by disabled persons, motor caravans (not for first taxing) and vintage or veteran vehicles
ga: Ní féidir cáin a íoc ar líne ach ar na saghsanna a leanas d’fheithiclí; gluaisteáin phríobháideacha, gluaisrothair, tarracóirí talmhaíochta, tochaltóirí, comhbhuainteoirí, cóiste na marbh, feithiclí a oiriúnaítear d’úsáid ag daoine faoi mhíchumas, mótarcharbháin (seachas i gcás cáin a íoc den chéad uair) agus feithiclí seanré

source: You can renew motor tax for a goods/commercial vehicle online providing you have a certificate of roadworthiness which is valid from the beginning of the new motor tax period
ga: Féadfaidh tú mótarcháin a athnuachan a íoc ar fheithicil earraí/tráchtála ar líne a fhad agus go bhfuil deimhniú ródacmhainneachta agat atá bailí ó thús na tréimhse nua mótarchánach

source: If the unladen weight does not exceed 1,524 kg (3,500 kg Gross Vehicle Weight) you must have submitted goods declaration form RF111A to your local motor tax office
ga: Mura sáraíonn an t-ualach neamhualaithe 1,524kg (Ollualach Feithicle 3,500 kg), ní mór gur sheol tú foirm dhearbhaithe earraí RF111A chuig d’oifig mhótarchánach áitiúil

source: Applying for a refund of motor tax
ga: Iarratas a dhéanamh ar aisíocaíocht mótarchánach

source: To apply for a refund of motor tax, you need to download and complete form RF120 (pdf)
ga: Chun iarratas a dhéanamh ar aisíocaíocht mótarchánach, is gá duit foirm RF120 a íoslódáil agus a chomhlánú (pdf)

source: Your completed application form should include the current tax disc and the Vehicle Licensing/Registration Certificate or Registration Book
ga: Ba cheart go dtabharfaí le fios ar d’fhoirm chomhlánaithe iarratais an diosca reatha cánacha agus an Deimhniú Ceadúnaithe/Cláraithe Feithicle nó Leabhar Cláraithe na Feithicle

source: If you are claiming a refund on the basis of an illness or injury, you should include a medical certificate from your doctor or health professional
ga: Má tá aisíocaíocht á héileamh agat ar bhonn galair nó gortú, ba cheart duit teastas dochtúra a chur san áireamh ó do dhochtúir nó do ghairmí sláinte

source: If you are claiming a refund on the basis of an absence from the State for business or educational purposes, you should have a letter from your employer or educational facilitity as evidence of this
ga: Má tá aisíocaíocht á éileamh agat ar bhonn asláithreachta ón Stát ar mhaithe le cuspóirí gnó nó oideachasúla, ba cheart go mbeadh litir agat ó d’fhostóir nó do shaoráid oideachais mar fhianaise ina leith seo

source: Your completed application form should be returned to your Motor Tax Office who will process your application
ga: Ba cheart d’fhoirm iarratais chomhlánaithe a sheoladh ar ais chuig d’Oifig Mhótarchánach, a dhéanfaidh d’iarratas a phróiseáil

source: Pay your motor tax online at www.motortax.ie
ga: Is féidir leat do mhótarcháin a íoc ar líne ag www.motortax.ie

source: Alternatively, contact the Motor Taxation Office of your local authority for more information and to pay your motor tax
ga: Mar rogha air sin, is féidir leat teagmháil a dhéanamh le hOifig Mhótarchánach d’údaráis áitiúil chun teacht ar bhreis faisnéise agus chun do mhótarcháin a íoc

source: Contact information for all local authorities in Ireland is listed in your public telephone directory
ga: Tá faisnéis teagmhála do gach údarás áitiúil in Éirinn liostaithe i d’eolaire gutháin phoiblí

source: The Vehicle Registration Unit at the Department of Transport, Tourism and Sport has responsibility for the registration of vehicle ownership
ga: Tá an tAonad Clárúcháin Feithiclí sa Roinn Iompair, Turasóireachta agus Spóirt freagrach as úinéireacht feithiclí a chlárú
